GopalSaraf/Practicals/PSDL/include/proc/pic18lf6490.inc
// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
LCDDATA10                                equ 0F6Ah
// bitfield definitions
LCDDATA10_LCDDATA10_POSN                 equ 0000h
LCDDATA10_LCDDATA10_POSITION             equ 0000h
LCDDATA10_LCDDATA10_SIZE                 equ 0008h
LCDDATA10_LCDDATA10_LENGTH               equ 0008h
LCDDATA10_LCDDATA10_MASK                 equ 00FFh
LCDDATA10_S32C1_POSN                     equ 0000h
LCDDATA10_S32C1_POSITION                 equ 0000h
LCDDATA10_S32C1_SIZE                     equ 0001h
LCDDATA10_S32C1_LENGTH                   equ 0001h
LCDDATA10_S32C1_MASK                     equ 0001h
LCDDATA10_S33C1_POSN                     equ 0001h
LCDDATA10_S33C1_POSITION                 equ 0001h
LCDDATA10_S33C1_SIZE                     equ 0001h
LCDDATA10_S33C1_LENGTH                   equ 0001h
LCDDATA10_S33C1_MASK                     equ 0002h
LCDDATA10_S34C1_POSN                     equ 0002h
LCDDATA10_S34C1_POSITION                 equ 0002h
LCDDATA10_S34C1_SIZE                     equ 0001h
LCDDATA10_S34C1_LENGTH                   equ 0001h
LCDDATA10_S34C1_MASK                     equ 0004h
LCDDATA10_S35C1_POSN                     equ 0003h
LCDDATA10_S35C1_POSITION                 equ 0003h
LCDDATA10_S35C1_SIZE                     equ 0001h
LCDDATA10_S35C1_LENGTH                   equ 0001h
LCDDATA10_S35C1_MASK                     equ 0008h
LCDDATA10_S36C1_POSN                     equ 0004h
LCDDATA10_S36C1_POSITION                 equ 0004h
LCDDATA10_S36C1_SIZE                     equ 0001h
LCDDATA10_S36C1_LENGTH                   equ 0001h
LCDDATA10_S36C1_MASK                     equ 0010h
LCDDATA10_S37C1_POSN                     equ 0005h
LCDDATA10_S37C1_POSITION                 equ 0005h
LCDDATA10_S37C1_SIZE                     equ 0001h
LCDDATA10_S37C1_LENGTH                   equ 0001h
LCDDATA10_S37C1_MASK                     equ 0020h
LCDDATA10_S38C1_POSN                     equ 0006h
LCDDATA10_S38C1_POSITION                 equ 0006h
LCDDATA10_S38C1_SIZE                     equ 0001h
LCDDATA10_S38C1_LENGTH                   equ 0001h
LCDDATA10_S38C1_MASK                     equ 0040h
LCDDATA10_S39C1_POSN                     equ 0007h
LCDDATA10_S39C1_POSITION                 equ 0007h
LCDDATA10_S39C1_SIZE                     equ 0001h
LCDDATA10_S39C1_LENGTH                   equ 0001h
LCDDATA10_S39C1_MASK                     equ 0080h
LCDDATA10_SEG32COM1_POSN                 equ 0000h
LCDDATA10_SEG32COM1_POSITION             equ 0000h
LCDDATA10_SEG32COM1_SIZE                 equ 0001h
LCDDATA10_SEG32COM1_LENGTH               equ 0001h
LCDDATA10_SEG32COM1_MASK                 equ 0001h
LCDDATA10_SEG33COM1_POSN                 equ 0001h
LCDDATA10_SEG33COM1_POSITION             equ 0001h
LCDDATA10_SEG33COM1_SIZE                 equ 0001h
LCDDATA10_SEG33COM1_LENGTH               equ 0001h
LCDDATA10_SEG33COM1_MASK                 equ 0002h
LCDDATA10_SEG34COM1_POSN                 equ 0002h
LCDDATA10_SEG34COM1_POSITION             equ 0002h
LCDDATA10_SEG34COM1_SIZE                 equ 0001h
LCDDATA10_SEG34COM1_LENGTH               equ 0001h
LCDDATA10_SEG34COM1_MASK                 equ 0004h
LCDDATA10_SEG35COM1_POSN                 equ 0003h
LCDDATA10_SEG35COM1_POSITION             equ 0003h
LCDDATA10_SEG35COM1_SIZE                 equ 0001h
LCDDATA10_SEG35COM1_LENGTH               equ 0001h
LCDDATA10_SEG35COM1_MASK                 equ 0008h
LCDDATA10_SEG36COM1_POSN                 equ 0004h
LCDDATA10_SEG36COM1_POSITION             equ 0004h
LCDDATA10_SEG36COM1_SIZE                 equ 0001h
LCDDATA10_SEG36COM1_LENGTH               equ 0001h
LCDDATA10_SEG36COM1_MASK                 equ 0010h
LCDDATA10_SEG37COM1_POSN                 equ 0005h
LCDDATA10_SEG37COM1_POSITION             equ 0005h
LCDDATA10_SEG37COM1_SIZE                 equ 0001h
LCDDATA10_SEG37COM1_LENGTH               equ 0001h
LCDDATA10_SEG37COM1_MASK                 equ 0020h
LCDDATA10_SEG38COM1_POSN                 equ 0006h
LCDDATA10_SEG38COM1_POSITION             equ 0006h
LCDDATA10_SEG38COM1_SIZE                 equ 0001h
LCDDATA10_SEG38COM1_LENGTH               equ 0001h
LCDDATA10_SEG38COM1_MASK                 equ 0040h
LCDDATA10_SEG39COM1_POSN                 equ 0007h
LCDDATA10_SEG39COM1_POSITION             equ 0007h
LCDDATA10_SEG39COM1_SIZE                 equ 0001h
LCDDATA10_SEG39COM1_LENGTH               equ 0001h
LCDDATA10_SEG39COM1_MASK                 equ 0080h

// Register: RCSTA2
#define RCSTA2 RCSTA2
RCSTA2                                   equ 0F6Bh
// bitfield definitions
RCSTA2_RX9D_POSN                         equ 0000h
RCSTA2_RX9D_POSITION                     equ 0000h
RCSTA2_RX9D_SIZE                         equ 0001h
RCSTA2_RX9D_LENGTH                       equ 0001h
RCSTA2_RX9D_MASK                         equ 0001h
RCSTA2_OERR_POSN                         equ 0001h
RCSTA2_OERR_POSITION                     equ 0001h
RCSTA2_OERR_SIZE                         equ 0001h
RCSTA2_OERR_LENGTH                       equ 0001h
RCSTA2_OERR_MASK                         equ 0002h
RCSTA2_FERR_POSN                         equ 0002h
RCSTA2_FERR_POSITION                     equ 0002h
RCSTA2_FERR_SIZE                         equ 0001h
RCSTA2_FERR_LENGTH                       equ 0001h
RCSTA2_FERR_MASK                         equ 0004h
RCSTA2_ADDEN_POSN                        equ 0003h
RCSTA2_ADDEN_POSITION                    equ 0003h
RCSTA2_ADDEN_SIZE                        equ 0001h
RCSTA2_ADDEN_LENGTH                      equ 0001h
RCSTA2_ADDEN_MASK                        equ 0008h
RCSTA2_CREN_POSN                         equ 0004h
RCSTA2_CREN_POSITION                     equ 0004h
RCSTA2_CREN_SIZE                         equ 0001h
RCSTA2_CREN_LENGTH                       equ 0001h
RCSTA2_CREN_MASK                         equ 0010h
RCSTA2_SREN_POSN                         equ 0005h
RCSTA2_SREN_POSITION                     equ 0005h
RCSTA2_SREN_SIZE                         equ 0001h
RCSTA2_SREN_LENGTH                       equ 0001h
RCSTA2_SREN_MASK                         equ 0020h
RCSTA2_RX9_POSN                          equ 0006h
RCSTA2_RX9_POSITION                      equ 0006h
RCSTA2_RX9_SIZE                          equ 0001h
RCSTA2_RX9_LENGTH                        equ 0001h
RCSTA2_RX9_MASK                          equ 0040h
RCSTA2_SPEN_POSN                         equ 0007h
RCSTA2_SPEN_POSITION                     equ 0007h
RCSTA2_SPEN_SIZE                         equ 0001h
RCSTA2_SPEN_LENGTH                       equ 0001h
RCSTA2_SPEN_MASK                         equ 0080h
RCSTA2_RCD8_POSN                         equ 0000h
RCSTA2_RCD8_POSITION                     equ 0000h
RCSTA2_RCD8_SIZE                         equ 0001h
RCSTA2_RCD8_LENGTH                       equ 0001h
RCSTA2_RCD8_MASK                         equ 0001h
RCSTA2_ADEN_POSN                         equ 0003h
RCSTA2_ADEN_POSITION                     equ 0003h
RCSTA2_ADEN_SIZE                         equ 0001h
RCSTA2_ADEN_LENGTH                       equ 0001h
RCSTA2_ADEN_MASK                         equ 0008h
RCSTA2_RC9_POSN                          equ 0006h
RCSTA2_RC9_POSITION                      equ 0006h
RCSTA2_RC9_SIZE                          equ 0001h
RCSTA2_RC9_LENGTH                        equ 0001h
RCSTA2_RC9_MASK                          equ 0040h
RCSTA2_NOT_RC8_POSN                      equ 0006h
RCSTA2_NOT_RC8_POSITION                  equ 0006h
RCSTA2_NOT_RC8_SIZE                      equ 0001h
RCSTA2_NOT_RC8_LENGTH                    equ 0001h
RCSTA2_NOT_RC8_MASK                      equ 0040h
RCSTA2_nRC8_POSN                         equ 0006h
RCSTA2_nRC8_POSITION                     equ 0006h
RCSTA2_nRC8_SIZE                         equ 0001h
RCSTA2_nRC8_LENGTH                       equ 0001h
RCSTA2_nRC8_MASK                         equ 0040h
RCSTA2_RC8_9_POSN                        equ 0006h
RCSTA2_RC8_9_POSITION                    equ 0006h
RCSTA2_RC8_9_SIZE                        equ 0001h
RCSTA2_RC8_9_LENGTH                      equ 0001h
RCSTA2_RC8_9_MASK                        equ 0040h
RCSTA2_RX9D2_POSN                        equ 0000h
RCSTA2_RX9D2_POSITION                    equ 0000h
RCSTA2_RX9D2_SIZE                        equ 0001h
RCSTA2_RX9D2_LENGTH                      equ 0001h
RCSTA2_RX9D2_MASK                        equ 0001h
RCSTA2_OERR2_POSN                        equ 0001h
RCSTA2_OERR2_POSITION                    equ 0001h
RCSTA2_OERR2_SIZE                        equ 0001h
RCSTA2_OERR2_LENGTH                      equ 0001h
RCSTA2_OERR2_MASK                        equ 0002h
RCSTA2_FERR2_POSN                        equ 0002h
RCSTA2_FERR2_POSITION                    equ 0002h
RCSTA2_FERR2_SIZE                        equ 0001h
RCSTA2_FERR2_LENGTH                      equ 0001h
RCSTA2_FERR2_MASK                        equ 0004h
RCSTA2_ADDEN2_POSN                       equ 0003h
RCSTA2_ADDEN2_POSITION                   equ 0003h
RCSTA2_ADDEN2_SIZE                       equ 0001h
RCSTA2_ADDEN2_LENGTH                     equ 0001h
RCSTA2_ADDEN2_MASK                       equ 0008h
RCSTA2_CREN2_POSN                        equ 0004h
RCSTA2_CREN2_POSITION                    equ 0004h
RCSTA2_CREN2_SIZE                        equ 0001h
RCSTA2_CREN2_LENGTH                      equ 0001h
RCSTA2_CREN2_MASK                        equ 0010h
RCSTA2_SREN2_POSN                        equ 0005h
RCSTA2_SREN2_POSITION                    equ 0005h
RCSTA2_SREN2_SIZE                        equ 0001h
RCSTA2_SREN2_LENGTH                      equ 0001h
RCSTA2_SREN2_MASK                        equ 0020h
RCSTA2_RX92_POSN                         equ 0006h
RCSTA2_RX92_POSITION                     equ 0006h
RCSTA2_RX92_SIZE                         equ 0001h
RCSTA2_RX92_LENGTH                       equ 0001h
RCSTA2_RX92_MASK                         equ 0040h
RCSTA2_SPEN2_POSN                        equ 0007h
RCSTA2_SPEN2_POSITION                    equ 0007h
RCSTA2_SPEN2_SIZE                        equ 0001h
RCSTA2_SPEN2_LENGTH                      equ 0001h
RCSTA2_SPEN2_MASK                        equ 0080h
RCSTA2_RCD82_POSN                        equ 0000h
RCSTA2_RCD82_POSITION                    equ 0000h
RCSTA2_RCD82_SIZE                        equ 0001h
RCSTA2_RCD82_LENGTH                      equ 0001h
RCSTA2_RCD82_MASK                        equ 0001h
RCSTA2_RC8_92_POSN                       equ 0006h
RCSTA2_RC8_92_POSITION                   equ 0006h
RCSTA2_RC8_92_SIZE                       equ 0001h
RCSTA2_RC8_92_LENGTH                     equ 0001h
RCSTA2_RC8_92_MASK                       equ 0040h
RCSTA2_RC92_POSN                         equ 0006h
RCSTA2_RC92_POSITION                     equ 0006h
RCSTA2_RC92_SIZE                         equ 0001h
RCSTA2_RC92_LENGTH                       equ 0001h
RCSTA2_RC92_MASK                         equ 0040h

// Register: TXSTA2
#define TXSTA2 TXSTA2
TXSTA2                                   equ 0F6Ch
// bitfield definitions
TXSTA2_TX9D_POSN                         equ 0000h
TXSTA2_TX9D_POSITION                     equ 0000h
TXSTA2_TX9D_SIZE                         equ 0001h
TXSTA2_TX9D_LENGTH                       equ 0001h
TXSTA2_TX9D_MASK                         equ 0001h
TXSTA2_TRMT_POSN                         equ 0001h
TXSTA2_TRMT_POSITION                     equ 0001h
TXSTA2_TRMT_SIZE                         equ 0001h
TXSTA2_TRMT_LENGTH                       equ 0001h
TXSTA2_TRMT_MASK                         equ 0002h
TXSTA2_BRGH_POSN                         equ 0002h
TXSTA2_BRGH_POSITION                     equ 0002h
TXSTA2_BRGH_SIZE                         equ 0001h
TXSTA2_BRGH_LENGTH                       equ 0001h
TXSTA2_BRGH_MASK                         equ 0004h
TXSTA2_SYNC_POSN                         equ 0004h
TXSTA2_SYNC_POSITION                     equ 0004h
TXSTA2_SYNC_SIZE                         equ 0001h
TXSTA2_SYNC_LENGTH                       equ 0001h
TXSTA2_SYNC_MASK                         equ 0010h
TXSTA2_TXEN_POSN                         equ 0005h
TXSTA2_TXEN_POSITION                     equ 0005h
TXSTA2_TXEN_SIZE                         equ 0001h
TXSTA2_TXEN_LENGTH                       equ 0001h
TXSTA2_TXEN_MASK                         equ 0020h
TXSTA2_TX9_POSN                          equ 0006h
TXSTA2_TX9_POSITION                      equ 0006h
TXSTA2_TX9_SIZE                          equ 0001h
TXSTA2_TX9_LENGTH                        equ 0001h
TXSTA2_TX9_MASK                          equ 0040h
TXSTA2_CSRC_POSN                         equ 0007h
TXSTA2_CSRC_POSITION                     equ 0007h
TXSTA2_CSRC_SIZE                         equ 0001h
TXSTA2_CSRC_LENGTH                       equ 0001h
TXSTA2_CSRC_MASK                         equ 0080h
TXSTA2_TXD8_POSN                         equ 0000h
TXSTA2_TXD8_POSITION                     equ 0000h
TXSTA2_TXD8_SIZE                         equ 0001h
TXSTA2_TXD8_LENGTH                       equ 0001h
TXSTA2_TXD8_MASK                         equ 0001h
TXSTA2_TX8_9_POSN                        equ 0006h
TXSTA2_TX8_9_POSITION                    equ 0006h
TXSTA2_TX8_9_SIZE                        equ 0001h
TXSTA2_TX8_9_LENGTH                      equ 0001h
TXSTA2_TX8_9_MASK                        equ 0040h
TXSTA2_NOT_TX8_POSN                      equ 0006h
TXSTA2_NOT_TX8_POSITION                  equ 0006h
TXSTA2_NOT_TX8_SIZE                      equ 0001h
TXSTA2_NOT_TX8_LENGTH                    equ 0001h
TXSTA2_NOT_TX8_MASK                      equ 0040h
TXSTA2_nTX8_POSN                         equ 0006h
TXSTA2_nTX8_POSITION                     equ 0006h
TXSTA2_nTX8_SIZE                         equ 0001h
TXSTA2_nTX8_LENGTH                       equ 0001h
TXSTA2_nTX8_MASK                         equ 0040h
TXSTA2_TX9D2_POSN                        equ 0000h
TXSTA2_TX9D2_POSITION                    equ 0000h
TXSTA2_TX9D2_SIZE                        equ 0001h
TXSTA2_TX9D2_LENGTH                      equ 0001h
TXSTA2_TX9D2_MASK                        equ 0001h
TXSTA2_TRMT2_POSN                        equ 0001h
TXSTA2_TRMT2_POSITION                    equ 0001h
TXSTA2_TRMT2_SIZE                        equ 0001h
TXSTA2_TRMT2_LENGTH                      equ 0001h
TXSTA2_TRMT2_MASK                        equ 0002h
TXSTA2_BRGH2_POSN                        equ 0002h
TXSTA2_BRGH2_POSITION                    equ 0002h
TXSTA2_BRGH2_SIZE                        equ 0001h
TXSTA2_BRGH2_LENGTH                      equ 0001h
TXSTA2_BRGH2_MASK                        equ 0004h
TXSTA2_SENDB2_POSN                       equ 0003h
TXSTA2_SENDB2_POSITION                   equ 0003h
TXSTA2_SENDB2_SIZE                       equ 0001h
TXSTA2_SENDB2_LENGTH                     equ 0001h
TXSTA2_SENDB2_MASK                       equ 0008h
TXSTA2_SYNC2_POSN                        equ 0004h
TXSTA2_SYNC2_POSITION                    equ 0004h
TXSTA2_SYNC2_SIZE                        equ 0001h
TXSTA2_SYNC2_LENGTH                      equ 0001h
TXSTA2_SYNC2_MASK                        equ 0010h
TXSTA2_TXEN2_POSN                        equ 0005h
TXSTA2_TXEN2_POSITION                    equ 0005h
TXSTA2_TXEN2_SIZE                        equ 0001h
TXSTA2_TXEN2_LENGTH                      equ 0001h
TXSTA2_TXEN2_MASK                        equ 0020h
TXSTA2_TX92_POSN                         equ 0006h
TXSTA2_TX92_POSITION                     equ 0006h
TXSTA2_TX92_SIZE                         equ 0001h
TXSTA2_TX92_LENGTH                       equ 0001h
TXSTA2_TX92_MASK                         equ 0040h
TXSTA2_CSRC2_POSN                        equ 0007h
TXSTA2_CSRC2_POSITION                    equ 0007h
TXSTA2_CSRC2_SIZE                        equ 0001h
TXSTA2_CSRC2_LENGTH                      equ 0001h
TXSTA2_CSRC2_MASK                        equ 0080h
TXSTA2_TXD82_POSN                        equ 0000h
TXSTA2_TXD82_POSITION                    equ 0000h
TXSTA2_TXD82_SIZE                        equ 0001h
TXSTA2_TXD82_LENGTH                      equ 0001h
TXSTA2_TXD82_MASK                        equ 0001h
TXSTA2_TX8_92_POSN                       equ 0006h
TXSTA2_TX8_92_POSITION                   equ 0006h
TXSTA2_TX8_92_SIZE                       equ 0001h
TXSTA2_TX8_92_LENGTH                     equ 0001h
TXSTA2_TX8_92_MASK                       equ 0040h

// Register: TXREG2
#define TXREG2 TXREG2
TXREG2                                   equ 0F6Dh

// Register: RCREG2
#define RCREG2 RCREG2
RCREG2                                   equ 0F6Eh

